2021-11-07-code-as-data-in-lisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Code as data in LISP</title>
<meta name="generator" content="Org mode" />
<meta name="keywords" content="&quot;code as data&quot;, &quot;LISP&quot;, &quot;Julia&quot;, &quot;Python&quot;" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Code as data in LISP</h1>
<p>
I heard about this "code as data" in LISP is so cool recently, and I was wondering how come I never realize it when I learned it, so I want back and took the [Programming Languages B](<a href="https://www.coursera.org/learn/programming-languages-part-b">https://www.coursera.org/learn/programming-languages-part-b</a>) course again. It is taught in Racket (a dialect of LISP). And Dan only briefly mentioned this "code as data" idea in an optional lecture.
</p>

<p>
The idea is that LISP can take a program at runtime, modify it, (and then evaluate/run it). Actually, this is not something unique to LISP. A lot of "LISP inspired languages", such as Python, can take a string at runtime, modify the string, and then evaluate it. (Python also have ast.parse to parse the string into AST to make it easier to modify.) The reason it is especially cool in LISP is that: Data is represented as a list, and a program is also represented as a list (you need a quote if you really want to interpret it as data before evaluation).
</p>

<p>
<a href="https://stackoverflow.com/questions/31733766/in-what-sense-are-languages-like-elixir-and-julia-homoiconic">Another advantage of this same representation of data and code in LISP</a> is that: when you write macro's, what you write is what will be generated. Unlike in Julia, for example, you'd better check the generated code is what you want.
</p>

<p>
I found <a href="https://www.youtube.com/watch?v=CVKIpfDqs3I&amp;t=622s">this video</a> showcasing this feature in Python, Scheme, and Julia.
</p>

<p>
I feel this idea sounds very attractive to maybe people how study mathematics or other hard core science, because it has some physiological beauty. To me, maybe some other software engineers as well, it is only something sounds beautiful, but not really usefuly in most cases. As Dan mention, often times when people think they need it, there is actually better way to do it instead of doing eval.
</p>

<script src="https://utteranc.es/client.js"
        repo="sychen52/sychen52.github.io"
        issue-term="pathname"
        theme="github-dark"
        crossorigin="anonymous"
        async>
</script>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-11-07 Sun 00:00</p>
<p class="validation"></p>
</div>
</body>
</html>
